#+TITLE: Artificial Neural Network From Scratch

** Backpropagation
:PROPERTIES:
:header-args:python: :session *backpropagation*
:END:

I want this code to be perfectly repeatable. But since we'll be initializing some random numbers, you're results might vary if you try to run this code. Therefore, let's give Numpy a specific seed for its random number generation so that we all get the same "random" numbers.

#+begin_src python :results none :noweb yes
<<imports>>
<<helpers>>
random_state = RandomState(MT19937(SeedSequence(42)))
#+end_src

We want to predict whether a number is ~0~ or ~1~.

Input is a 3x3 grid. 9 values.

#+begin_src python :results output :noweb yes
ideal_zero = flatten([[1, 1, 1],
                      [1, 0, 1],
                      [1, 1, 1]])
ideal_one  = flatten([[0, 1, 0],
                      [0, 1, 0],
                      [0, 1, 0]])

# Truncated to 2 decimal places for nicer printing for examples.
vector_round = np.vectorize(round)
random_state = RandomState(MT19937(SeedSequence(42)))
weights = vector_round(random_state.rand(2, 9), 2)

# Given the above, we want to adjust our weights such that:
#
# np.dot(weights, ideal_zero) == [1, 0]
# and
# np.dot(weights, ideal_one) == [0, 1]
#
# Or, more accurately...
# prediction = np.dot(weights, ideal_zero)
# prediction.index(max(prediction)) == 0
# prediction = np.dot(weights, ideal_zero)
# prediction.index(max(prediction)) == 1
print(f"Ideal zero: {ideal_zero}")
print(f"Ideal one:  {ideal_one}")
print(f"Weights (random):\n{weights}")
print(f"Zero prediction: {np.dot(weights, ideal_zero)}")
print(f"One prediction:  {np.dot(weights, ideal_one)}")
#+end_src

#+RESULTS:
: Ideal zero: [1 1 1 1 0 1 1 1 1]
: Ideal one:  [0 1 0 0 1 0 0 1 0]
: Weights (random):
: [[0.54 0.62 0.06 0.81 0.86 0.63 0.68 0.68 0.48]
:  [0.73 0.16 0.73 0.22 0.7  0.96 0.28 0.71 0.89]]
: Zero prediction: [4.5  4.68]
: One prediction:  [2.16 1.57]

How can we adjust our weights so that ~np.dot(weigts, ideal_zero)~ is closer to ~[1, 0]~ than ~[0, 1]~?

We could hardcode some weights and get pretty close.

#+begin_src python :results output
hardcoded_weights = np.array([[0.2, 0.0, 0.2, 0.2, 0.0, 0.2, 0.2, 0.0, 0.2],
                              [0.0, 0.1, 0.0, 0.0, 0.9, 0.0, 0.0, 0.1, 0.0]])
print(f"Zero prediction: {np.dot(hardcoded_weights, ideal_zero)}")
print(f"One prediction:  {np.dot(hardcoded_weights, ideal_one)}")
#+end_src

#+RESULTS:
: Zero prediction: [1.2 0.2]
: One prediction:  [0.  1.1]

This gets us pretty close and is very intuitive.

If we provide weight such that the output neuron for ~1~ gets a value clse to one when the middle pixel is "on", then that gets us close to one.

How do we programatically find the optimal values for those weights?

Well, first we need to know how far away each value in that vector is from our ideal value so that we know which way we need to go.

The function that tells us that is known as the "cost" function.

#+begin_src python :results output
def errors(calculated_values, target_values):
    return target_values - calculated_values

random_state = RandomState(MT19937(SeedSequence(42)))
weights = vector_round(random_state.rand(2, 9), 2)

result_of_zero = np.dot(weights, ideal_zero)
expected_zero_output = np.array([1, 0])
errors_of_zero = errors(result_of_zero, expected_zero_output)
print(f"Result of zero: {result_of_zero}")
print(f"Ideal zero:     {expected_zero_output}")
print(f"Cost of zeros:  {errors_of_zero}")

result_of_one = np.dot(weights, ideal_one)
expected_one_output = np.array([0, 1])
errors_of_one = errors(result_of_one, expected_one_output)
print(f"Result of one: {result_of_one}")
print(f"Ideal one:     {expected_one_output}")
print(f"Cost of ones:  {errors_of_one}")
#+end_src

#+RESULTS:
: Result of zero: [4.5  4.68]
: Ideal zero:     [1 0]
: Cost of zeros:  [-3.5  -4.68]
: Result of one: [2.16 1.57]
: Ideal one:     [0 1]
: Cost of ones:  [-2.16 -0.57]

This tells us something. It tells us how far off our results are. We don't know what to do with that yet. But at least we have a programatic way to quantify "We need to lower the value of the 'zero' output node twice as much as we need to lower the value of the 'one' output node."

We know we want to adjust our weights so that our prediction gets closer.

We don't know whether to adjust our weights up or down. And we don't know by how much.

Let's just pick a weight and adjust it up and see what happens. If our prediction gets more accurate, we know we're on the right track. If it gets less accurate, then we can simply move the other direction.

#+begin_src python :results output
print(weights)
derivative_of_zero = np.dot(errors_of_zero.reshape(-1, 1), ideal_zero.reshape(1, -1))
print(derivative_of_zero)
derivative_of_one = np.dot(errors_of_one.reshape(-1, 1), ideal_one.reshape(1, -1))
print(derivative_of_one)
#+end_src

#+RESULTS:
: [[0.54 0.62 0.06 0.81 0.86 0.63 0.68 0.68 0.48]
:  [0.73 0.16 0.73 0.22 0.7  0.96 0.28 0.71 0.89]]
: [[-3.5  -3.5  -3.5  -3.5   0.   -3.5  -3.5  -3.5  -3.5 ]
:  [-4.68 -4.68 -4.68 -4.68  0.   -4.68 -4.68 -4.68 -4.68]]
: [[ 0.   -2.16  0.    0.   -2.16  0.    0.   -2.16  0.  ]
:  [ 0.   -0.57  0.    0.   -0.57  0.    0.   -0.57  0.  ]]

We have values that we can use to update our weights. Let's see what happens when we do that.

#+begin_src python :results output
LEARNING_RATE = 0.1
weights_trained_once = weights * derivative_of_zero * LEARNING_RATE
print((hardcoded_weights - weights).sum())
print((hardcoded_weights - weights_trained_once).sum())
#+end_src

#+RESULTS:
: -8.440000000000001
: 6.065240000000001

We are closer to our ideal hardcoded weights. Let's train it again.

#+begin_src python :results output
result_of_zero_after_training_once = np.dot(weights_trained_once, ideal_zero)
errors_of_zero_after_training_once = errors(
    result_of_zero_after_training_once,
    expected_zero_output
)
print(f"Result of zero: {result_of_zero_after_training_once}")
print(f"Ideal zero:     {expected_zero_output}")
print(f"Cost of zeros after no training:    {errors_of_zero}")
print(f"Cost of zeros after training once:  {errors_of_zero_after_training_once}")

derivative_of_zero_after_training_once = np.dot(
    errors_of_zero_after_training_once.reshape(-1, 1),
    ideal_zero.reshape(1, -1)
)
weights_trained_twice = (
    weights
    ,* derivative_of_zero_after_training_once
    ,* LEARNING_RATE
)

result_of_zero_after_training_twice = np.dot(weights_trained_twice, ideal_zero)
errors_of_zero_after_training_twice = errors(
    result_of_zero_after_training_twice,
    expected_zero_output
)
print(f"Result of zero: {result_of_zero_after_training_twice}")
print(f"Ideal zero:     {expected_zero_output}")
print(f"Total error after no training:    {errors_of_zero.sum()}")
print(f"Total error after training once:  {errors_of_zero_after_training_once.sum()}")
print(f"Total error after training twice: {errors_of_zero_after_training_twice.sum()}")
#+end_src

#+begin_src python :results output
print(f"Weights: \n{vector_round(weights_trained_twice, 2)}\n")
#+end_src

#+RESULTS:
: Weights:
: [[0.14 0.16 0.02 0.21 0.   0.16 0.18 0.18 0.12]
:  [0.16 0.04 0.16 0.05 0.   0.21 0.06 0.16 0.19]]


#+begin_src python :results output
def cost(calculated, target):
    return (calculated - target) ** 2

def cost_prime(weights, inputs, target):
    return 2 * np.dot(weights, inputs) - 2 * target

adjustment = np.dot(weights.T, errors_of_one)
new_weights = weights + 0.1 * weights * adjustment
new_weights = np.array(vector_round(new_weights, 2))
print(weights)
print(new_weights)
print(np.array(hardcoded_weights))
#+end_src

#+RESULTS:
: [[0.54 0.62 0.06 0.81 0.86 0.63 0.68 0.68 0.48]
:  [0.73 0.16 0.73 0.22 0.7  0.96 0.28 0.71 0.89]]
: [[0.45 0.53 0.06 0.66 0.67 0.51 0.57 0.55 0.41]
:  [0.61 0.14 0.69 0.18 0.54 0.78 0.23 0.58 0.75]]
: [[0.2 0.  0.2 0.2 0.  0.2 0.2 0.  0.2]
:  [0.  0.1 0.  0.  0.9 0.  0.  0.1 0. ]]

